projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ДополнительныеАналитикиЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДополнительныеАналитикиЦенообразования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлючиАналитикЦенообразования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдминистративныеОкруги</v8:Type>
						<v8:Type>cfg:CatalogRef.СтранаОформления</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировкиВКлючеАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыДополнительныхАналитикЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДополнительныхАналитикЦенообразования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТаможенныхПунктов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ДополнительныеАналитикиЦенообразования/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЭлементЗначениеАналитикиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Владелец.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец);

КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьЭлементЗначениеАналитикиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементЗначениеАналитикиНаСервере()
	
	Элементы.ЗначениеАналитики.АвтоОтметкаНезаполненного = Истина;
	Если ЗначениеЗаполнено(Объект.Владелец) И Объект.Владелец.ИспользоватьДополнительнуюАналитику Тогда
		Если Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.АдминистративныйОкруг Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Административный округ";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.АдминистративныеОкруги");
			Элементы.ЗначениеАналитики.АвтоОтметкаНезаполненного = Ложь;
		ИначеЕсли Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Расстояние, км";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("Число");
		ИначеЕсли Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Страна Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Страна";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтранаОформления");
		ИначеЕсли Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.КоличествоТаможенныхПунктов Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Кол-во таможенных пунктов";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("Число");
		Иначе 
			Элементы.ЗначениеАналитики.Заголовок = "Значение аналитики";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Неопределено;
		КонецЕсли;
	Иначе
		Элементы.ЗначениеАналитики.Заголовок = "Значение аналитики";
		Элементы.ЗначениеАналитики.ОграничениеТипа = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
